app/controllers/api/v1/greetings_controller.rb

      def index
        @greetings = Greeting.order(Arel.sql('RANDOM()')).first
---
SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]